[
  {
    "from": "Jan 2024",
    "to": "present",
    "icon": "https://d1hbpr09pwz0sk.cloudfront.net/logo_url/vela-technologies-india-9562d2ee",
    "company": "Vela Technologies India",
    "position": "Software Engineer",
    "experience": [
      "Gathered and analyzed requirements by collaborating with project managers, senior developers, and testers.",
      "Participated in sprint planning, breaking down requirements into user stories and tasks.",
      "Designed and developed REST APIs using .NET core.",
      "Experienced in Entity Framework and Migration to EF Core.",
      "Created and maintained integration tests and unit tests for REST APIs, enhancing code quality.",
      "Managed deployments, handled Azure infrastructure and optimized scripts to reduce deployment time by 15%.",
      "Resolved production issues, improving application stability.",
      "Managed SQL Server databases, optimizing queries for better performance",
      "Integrated SonarQube and OWASP dependency check in build pipelines there by increased security and code quality.",
      "Migated api project from .NET framework 4.7.2 to .NET 8"
    ],
    "id": 3
  },
  {
    "from": "Jul 2022",
    "to": "Dec 2023",
    "icon": "https://d1hbpr09pwz0sk.cloudfront.net/logo_url/vela-technologies-india-9562d2ee",
    "company": "Vela Technologies India",
    "position": "Associate Software Engineer",
    "experience": [
      "Configured high availability system, and disaster recovery to reduce the system downtime.",
      "Configured Application Gateway for load balancing, enabling Web Application Firewall(WAF).",
      "Utilized Key Vault for securing app configuration and restricting human intervention accessibility by 100%.",
      "Fixed bugs, reducing issue backlog by 10% and contributed in solving 20% of SonarQube identified vulnerabilities.",
      "Established CI/CD pipeline with Azure DevOps there by reduced overall component deployment time by 25%.",
      "Hosted docker images using azure app services.",
      "Developed a platform to build the tenant infrastructures using Typescript, React and .Net"
    ],
    "id": 2
  },
  {
    "from": "Mar 2022",
    "to": "Jul 2022",
    "icon": "https://d1hbpr09pwz0sk.cloudfront.net/logo_url/vela-technologies-india-9562d2ee",
    "company": "Vela Technologies India",
    "position": "Trainee Software Engineer (Intern)",
    "experience": [
      "Implemented Rest APIs for dealing with azure blob storage using Microsoft SDK.",
      "Implemented React SPA.",
      "Integrated Azure B2C for enabling different identity providers while Sign In."
    ],
    "id": 1
  }
]
